# Run with: brew bundle
# To regenerate from your current machine: brew bundle dump --force

# ── Version control & GitHub ──────────────────────────────────────────────────
brew "git"
brew "gh"
brew "gnupg"

# ── Languages & runtimes ──────────────────────────────────────────────────────
brew "node"
brew "go"
brew "pyenv"
brew "dotnet@9"

# ── Infrastructure & secrets ──────────────────────────────────────────────────
brew "tfenv"
brew "vault"

# ── Kubernetes ────────────────────────────────────────────────────────────────
brew "kubernetes-cli"
brew "kubectx"
brew "kubelogin"
brew "k9s"
brew "minikube"

# ── CLI utilities ─────────────────────────────────────────────────────────────
brew "jq"
brew "yq"
brew "wget"
brew "tree"
brew "ripgrep"

# ── Zsh plugins ───────────────────────────────────────────────────────────────
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ── Apps ──────────────────────────────────────────────────────────────────────
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "slack"
cask "zoom"
cask "spotify"
cask "visual-studio-code"
cask "font-hack-nerd-font"
cask "1password-cli"
